## Task 1

In [1]:
import pandas as pd

data={'First Name': ['Alice', 'Bob','Charlie', 'David'],
      'Age':[25,30,35,40],
      'City':['New York', 'San Francisco', 'Los Angeles', 'Chicago']}

df=pd.DataFrame(data)

In [6]:
#1
Z=df.rename(columns={'First Name':'first_name', 'Age':'age'})
Z

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [7]:
#2
df.head(3)

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [11]:
#3
print(df['Age'].mean())

32.5

In [13]:
#4
print(df[['First Name','City']])

  First Name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [16]:
#5
df['Salary']=[12000,20000,15000,23000]
df

  First Name  Age           City  Salary
0      Alice   25       New York   12000
1        Bob   30  San Francisco   20000
2    Charlie   35    Los Angeles   15000
3      David   40        Chicago   23000

In [18]:
#6
df.describe()

             Age        Salary
count   4.000000      4.000000
mean   32.500000  17500.000000
std     6.454972   4932.882862
min    25.000000  12000.000000
25%    28.750000  14250.000000
50%    32.500000  17500.000000
75%    36.250000  20750.000000
max    40.000000  23000.000000

## Task 2

In [21]:
data2={
    'Month':['Jan','Feb','Mar','Apr'],
    'Sales':[5000,6000,7500,8000],
    'Expenses':[3000,3500,4000,4500]
}

df2=pd.DataFrame(data2)
df2

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [27]:
#1
print(f"Maximum Sales : {df['Sales'].max()}, Maximum Expenses: {df['Expenses'].max()}")

Maximum Sales : 8000, Maximum Expenses: 4500

In [28]:
#2
print(f"Minimum Sales : {df['Sales'].min()}, Minimum Expenses: {df['Expenses'].min()}")

Minimum Sales : 5000, Minimum Expenses: 3000

In [29]:
#3
print(f"Average Sales : {df['Sales'].mean()}, Average Expenses: {df['Expenses'].mean()}")

Average Sales : 6625.0, Average Expenses: 3750.0

## Task 3 (T-SQL 1)

In [30]:
#1
import pandas as pd

data = {
    "BusinessEntityID": [275, 275, 275, 275, 275, 275],
    "SalesYear": [2005, 2005, 2006, 2006, 2006, 2006],
    "CurrentQuota": [367000.00, 556000.00, 502000.00, 550000.00, 1429000.00, 1324000.00]
}

df = pd.DataFrame(data)

df.sort_values(by=["BusinessEntityID", "SalesYear"], inplace=True)

df["PreviousQuota"] = df["CurrentQuota"].shift(1)

print(df)

   BusinessEntityID  SalesYear  CurrentQuota  PreviousQuota
0               275       2005      367000.0            NaN
1               275       2005      556000.0       367000.0
2               275       2006      502000.0       556000.0
3               275       2006      550000.0       502000.0
4               275       2006     1429000.0       550000.0
5               275       2006     1324000.0      1429000.0

In [32]:
#2
data = {
    "BusinessEntityID": [275, 275, 275, 275, 275, 275],
    "SalesYear": [2005, 2005, 2006, 2006, 2006, 2006],
    "CurrentQuota": [367000.00, 556000.00, 502000.00, 550000.00, 1429000.00, 1324000.00]
}

df = pd.DataFrame(data)

df.sort_values(by=["BusinessEntityID", "SalesYear"], inplace=True)

df["PreviousQuota"] = df["CurrentQuota"].shift(-1)

print(df)

   BusinessEntityID  SalesYear  CurrentQuota  PreviousQuota
0               275       2005      367000.0       556000.0
1               275       2005      556000.0       502000.0
2               275       2006      502000.0       550000.0
3               275       2006      550000.0      1429000.0
4               275       2006     1429000.0      1324000.0
5               275       2006     1324000.0            NaN

In [38]:
#3
data={
    'EmpName': ['Pawan','Zuzu','Parveen','Mahesh','Ramesh'],
    'BirthDate': pd.to_datetime(['12/04/1983','11/28/1986','05/07/1977','01/13/1983','05/09/1983'])
}

df=pd.DataFrame(data)

df['Month']=df['BirthDate'].dt.month
df['Day']=df['BirthDate'].dt.day

filtered_df=df[(df['Month']==5)&(df['Day'].between(7,15))]

filtered_df[['EmpName','BirthDate']]

   EmpName  BirthDate
2  Parveen 1977-05-07
4   Ramesh 1983-05-09

In [48]:
#4
data = {
    "MName": ["A", "A", "B", "B", "D", "E"],
    "AName": ["Amitabh", "Vinod", "Amitabh", "Vinod", "Amitabh", "Vinod"],
    "Roles": ["Actor", "Villan", "Actor", "Actor", "Actor", "Actor"]
}

df = pd.DataFrame(data)

amitabh = df[(df["AName"] == "Amitabh") & (df["Roles"] == "Actor")]["MName"]
vinod = df[(df["AName"] == "Vinod") & (df["Roles"] == "Actor")]["MName"]

common_movies = set(amitabh) & set(vinod)

result_df = df[df["MName"].isin(common_movies)]
print(result_df)

  MName    AName  Roles
2     B  Amitabh  Actor
3     B    Vinod  Actor

In [52]:
#5
data={
    'ID':[1,1],
    'Name':['P', None],
    'Typed':[None, 'Q']
}

df=pd.DataFrame(data)

filtered_df=df.fillna("").groupby('ID', as_index=False).max()
filtered_df

   ID Name Typed
0   1    P     Q